In [237]:
import pandas as pd 
import sqlite3 as sql

In [238]:
conn  = sql.connect("B:/prepinsta/week-5/sql-murder-mystery.db")

In [239]:
print(conn)

<sqlite3.Connection object at 0x0000018B4BE6F3D0>

1.  Retrieve Crime Scene Report:
Task: Run a query to retrieve the crime scene report for the murder that occurred on Jan.15, 2018, in SQL City. Gather all available details from the report.

In [240]:
query_1 ='''SELECT *
FROM crime_scene_report
WHERE city = 'SQL City'
AND date = '20180115';
'''
pd.set_option('display.max_colwidth', None)

pd.read_sql_query(query_1,conn)

,date,type,description,city
0,20180115,assault,"Hamilton: Lee, do you yield? Burr: You shot him in the side! Yes he yields!",SQL City
1,20180115,assault,Report Not Found,SQL City
2,20180115,murder,"Security footage shows that there were 2 witnesses. The first witness lives at the last house on ""Northwestern Dr"". The second witness, named Annabel, lives somewhere on ""Franklin Ave"".",SQL City

2. Witness Personal Details:
Task: Check the personal details of witnesses involved in the case. Retrieve their names, addresses, and any other relevant information.

In [241]:
query_2 = '''
SELECT *
FROM Person
WHERE address_street_name ='Northwestern Dr'
ORDER BY address_number desc;
'''

pd.read_sql_query(query_2, conn)[:1]

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

View Witness Interviews:
Task: Access the recorded interviews of witnesses conducted after the murder. Gather insights into their statements and potential clues.

In [242]:
query_3 =''' 
SELECT * FROM person 
WHERE name like '%Annabel%'
AND address_street_name = 'Franklin Ave';
'''
pd.set_option('display.max_colwidth', None)

pd.read_sql_query(query_3, conn)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

4. Check Gym Database:
Task: Investigate the gym database using details obtained from the crime scene report and witness interviews. Look for any gym-related information that might be relevant.

In [243]:
query_4 =''' 
SELECT *
FROM interview
WHERE 	person_id='16371' or person_id='14887'	;

'''
pd.set_option('display.max_colwidth', None)

pd.read_sql_query(query_4, conn)

,person_id,transcript
0,14887,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W""."
1,16371,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."

5. Check Car Details:
Task: Examine the car details associated with the crime scene. Retrieve information about the vehicles present during the incident.

In [244]:
query_5 ='''
SELECT *
FROM get_fit_now_check_in
WHERE membership_id LIKE '%48Z%' AND check_in_date='20180109'
order by check_in_date;

 '''

pd.read_sql_query(query_5,conn)

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730
1         48Z55       20180109           1530            1700

In [245]:
query_6=  '''
SELECT * 
FROM drivers_license
where plate_number like "%H42W%"; 
  
'''
pd.read_sql_query(query_6,conn)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,183779,21,65,blue,blonde,female,H42W0X,Toyota,Prius
1,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
2,664760,21,71,black,black,male,4H42WR,Nissan,Altima

6. Personal Details:
Task: Identify and collect personal details mentioned in the previous query. This includes names, addresses, and any additional details.

In [246]:
query_7=  '''
SELECT * 
FROM person
where license_id='423327' or license_id='664760'; 
  
'''
pd.read_sql_query(query_7,conn)

,id,name,license_id,address_number,address_street_name,ssn
0,51739,Tushar Chandra,664760,312,Phi St,137882671
1,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279

7. Membership Status at the Gym:
Task: Determine who is identified in the previous query as a member of the gym. Utilize the gym database to confirm their membership status.

In [247]:
query_8=  '''
SELECT * 
FROM get_fit_now_member
where person_id='51739' or person_id='67318' ; 
  
'''
pd.read_sql_query(query_8,conn)

      id  person_id           name  membership_start_date membership_status
0  48Z55      67318  Jeremy Bowers               20160101              gold

Jeremy Bowers is a murderer.........................

8. Analyze and Draw Conclusions:
Task: Analyze the collected data, including crime scene reports, witness interviews, gym records, and car details. Draw conclusions or hypotheses based on the information available

In [248]:
query_9=  '''
SELECT * 
FROM interview
where person_id='67318' ; 
  
'''
pd.read_sql_query(query_9,conn)

,person_id,transcript
0,67318,"I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5"" (65"") or 5'7"" (67""). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n"

In [249]:
query_10=  '''
SELECT * 
FROM drivers_license
WHERE car_make = 'Tesla'
  AND car_model = 'Model S'
  AND gender ='female'
  AND hair_color='red' 

  ;

'''
pd.read_sql_query(query_10,conn)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,202298,68,66,green,red,female,500123,Tesla,Model S
1,291182,65,66,blue,red,female,08CM64,Tesla,Model S
2,918773,48,65,black,red,female,917UU3,Tesla,Model S

In [250]:
query_11='''
SELECT *
FROM person 
WHERE license_id ='202298' OR license_id ='291182' OR license_id ='918773';
'''
pd.read_sql_query(query_11,conn)

,id,name,license_id,address_number,address_street_name,ssn
0,78881,Red Korb,918773,107,Camerata Dr,961388910
1,90700,Regina George,291182,332,Maple Ave,337169072
2,99716,Miranda Priestly,202298,1883,Golden Ave,987756388

In [251]:
query_12= '''
SELECT person_id, count(*), event_name
FROM facebook_event_checkin
GROUP BY person_id
HAVING count(*) = 3 AND event_name = "SQL Symphony Concert" AND date like "%201712%";
'''

pd.read_sql_query(query_12,conn)

   person_id  count(*)            event_name
0      24556         3  SQL Symphony Concert
1      99716         3  SQL Symphony Concert

Miranda Priestly